essele/Fluke_Z8_Emulator/PSoC_Workspace/Fluke Z8 Emulator.cydsn/Generated_Source/PSoC4/DATA1.h
/*******************************************************************************
* File Name: DATA1.h  
* Version 1.90
*
* Description:
*  This file containts Status Register function prototypes and register defines
*
* Note:
*
********************************************************************************
* Copyright 2008-2015, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
*******************************************************************************/

#if !defined(CY_STATUS_REG_DATA1_H) /* CY_STATUS_REG_DATA1_H */
#define CY_STATUS_REG_DATA1_H

#include "cyfitter.h"

#if ((CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC3) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC4) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC5))
    #include "cytypes.h"
    #include "CyLib.h"
#else
    #include "syslib/cy_syslib.h"
#endif

    
/***************************************
*     Data Struct Definitions
***************************************/

/* Sleep Mode API Support */
typedef struct
{
    uint8 statusState;

} DATA1_BACKUP_STRUCT;


/***************************************
*        Function Prototypes
***************************************/

uint8 DATA1_Read(void) ;
void DATA1_InterruptEnable(void) ;
void DATA1_InterruptDisable(void) ;
void DATA1_WriteMask(uint8 mask) ;
uint8 DATA1_ReadMask(void) ;


/***************************************
*           API Constants
***************************************/

#define DATA1_STATUS_INTR_ENBL    0x10u


/***************************************
*         Parameter Constants
***************************************/

/* Status Register Inputs */
#define DATA1_INPUTS              8


/***************************************
*             Registers
***************************************/

/* Status Register */
#define DATA1_Status             (* (reg8 *) DATA1_sts_sts_reg__STATUS_REG )
#define DATA1_Status_PTR         (  (reg8 *) DATA1_sts_sts_reg__STATUS_REG )
#define DATA1_Status_Mask        (* (reg8 *) DATA1_sts_sts_reg__MASK_REG )
#define DATA1_Status_Aux_Ctrl    (* (reg8 *) DATA1_sts_sts_reg__STATUS_AUX_CTL_REG )

#endif /* End CY_STATUS_REG_DATA1_H */


/* [] END OF FILE */
